app/views/jobs/_form.html.erb

SELECT  "categories".* FROM "categories"  WHERE "categories"."name" = 'Computer Science' LIMIT 1
---
    <div class="controls">
      <%= f.select :category_name, Category.all.collect{ |c| [c.name, c.id]} %>