app/controllers/home_controller.rb

SELECT  "admins".* FROM "admins"  WHERE "admins"."email" = 'admin@admin.com' LIMIT 1
SELECT  "jobseekers".* FROM "jobseekers"  WHERE "jobseekers"."email" = 'jobseeker@jobseeker.com' LIMIT 1
---
  def login_check

    @email=params[:login_email]

    @password = params[:login_password]

    @title = params[:theme]

    if(@title=='Admin')
      @admin=Admin.find_by_email(@email)
      if(@admin.is_a?NilClass)
        @custom_error = "Invalid Login Credentials. The username is invalid or the account does not exist."
        render "layouts/error"
        return
      else
        if(@admin.password==@password)
          cookies[:adminID] = @admin.id
          redirect_to @admin, :layout => true
          return
        else
          @custom_error = "Invalid Login Credentials"
          render "layouts/error"
          return
        end
      end


    elsif(@title=='Jobseeker')
      @jobseeker=Jobseeker.find_by_email(@email)

SELECT  "employers".* FROM "employers"  WHERE "employers"."email" = 'employer@employer.com' LIMIT 1
---
      end

    elsif (@title=='Employer')
      @employer=Employer.find_by_email(@email)